import React, { useState, useEffect } from "react";
import Container from "../../statics/Container/Container";
import classes from "./Properties.module.scss";
import Property from "./Property";
import { Swiper, SwiperSlide } from "swiper/react";

import "swiper/css";
import "swiper/css/navigation";
import "swiper/css/pagination";
import "swiper/css/scrollbar";

const Properties = () => {
   const useWidth = () => {
      const [width, setWidth] = useState(0);
      const handleResize = () => setWidth(window.innerWidth);
      useEffect(() => {
         handleResize();
         window.addEventListener("resize", handleResize);
         return () => window.removeEventListener("resize", handleResize);
      }, [handleResize]);
      return width;
   };

   const width = useWidth();
   const breakpoint = 768;
   const breakpointMobile = 425;

   const DesktopProperties = (
      <div className={classes.properties_box}>
         <Property
            image="/properties/property_1.png"
            alt="property"
            icon={
               <svg
                  width="36"
                  height="36"
                  viewBox="0 0 36 36"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
               >
                  <path
                     d="M17.8999 1C17.9554 10.3878 10.3908 18.045 1 18.1005C10.3908 18.045 18.0461 25.6118 18.1012 35C18.0461 25.6118 25.6126 17.955 35 17.8991C25.6126 17.955 17.9554 10.3878 17.8999 1Z"
                     stroke="white"
                     strokeWidth="3.5"
                  />
               </svg>
            }
            title="سیگنال‌های لحظه‌ای خرید و فروش"
            paragraph="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
         />
         <Property
            image="/properties/property_1.png"
            alt="property"
            icon={
               <svg
                  width="31"
                  height="34"
                  viewBox="0 0 31 34"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
               >
                  <path
                     d="M13.2671 10.22C13.2671 11.3722 12.3332 12.3064 11.1811 12.3064C10.0289 12.3064 9.09473 11.3722 9.09473 10.22C9.09473 9.06788 10.0289 8.13403 11.1811 8.13403C12.3332 8.13403 13.2671 9.06788 13.2671 10.22Z"
                     fill="white"
                  />
                  <path
                     d="M22.6553 10.22C22.6553 11.3722 21.7211 12.3064 20.5689 12.3064C19.4168 12.3064 18.4829 11.3722 18.4829 10.22C18.4829 9.06788 19.4168 8.13403 20.5689 8.13403C21.7211 8.13403 22.6553 9.06788 22.6553 10.22Z"
                     fill="white"
                  />
                  <path
                     d="M21.0904 20.1295C24.6306 20.1295 27.9019 18.2407 29.6722 15.1745C31.4425 12.1088 31.4425 8.33137 29.6722 5.26515C27.9019 2.19901 24.6306 0.310547 21.0904 0.310547H10.6595C7.11929 0.310547 3.84799 2.19901 2.07771 5.26515C0.307431 8.33128 0.307431 12.1086 2.07771 15.1745C3.84799 18.2407 7.11929 20.1295 10.6595 20.1295H13.7889V24.302L9.61648 24.3016C7.67996 24.3016 5.82279 25.071 4.45335 26.4404C3.08392 27.8098 2.31455 29.667 2.31455 31.6035V33.6895H6.48701V31.6035C6.48701 30.7737 6.81662 29.9777 7.4038 29.3909C7.99061 28.8037 8.78664 28.4741 9.61646 28.4741H22.1336C22.9634 28.4741 23.7594 28.8037 24.3462 29.3909C24.9334 29.9777 25.263 30.7737 25.263 31.6035V33.6895H29.4355V31.6035C29.4355 29.667 28.666 27.8098 27.2967 26.4404C25.9273 25.071 24.0701 24.3016 22.1336 24.3016H17.9611V20.1295L21.0904 20.1295ZM4.92247 10.2201C4.92247 8.69869 5.52711 7.23948 6.60287 6.16332C7.67902 5.08754 9.13824 4.48329 10.6597 4.48329H21.0906C23.1403 4.48329 25.0342 5.57649 26.0591 7.35152C27.0839 9.12683 27.0839 11.3137 26.0591 13.0887C25.0342 14.8637 23.1403 15.9573 21.0906 15.9573H10.6597C9.13824 15.9573 7.67902 15.3527 6.60287 14.2769C5.52709 13.2011 4.92247 11.7419 4.92247 10.2201Z"
                     fill="white"
                  />
               </svg>
            }
            title="هوش مصنوعی پیشرفته"
            paragraph="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
         />
         <Property
            image="/properties/property_1.png"
            alt="property"
            icon={
               <svg
                  width="37"
                  height="37"
                  viewBox="0 0 37 37"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
               >
                  <path
                     d="M16.096 23.3776V28.8711H19.5804V23.3776C21.3595 22.8182 22.7619 21.4378 23.3496 19.6677C23.9374 17.8972 23.6384 15.9524 22.5468 14.4399C21.4552 12.9274 19.7036 12.0314 17.8383 12.0314C15.973 12.0314 14.2211 12.9274 13.1295 14.4399C12.0379 15.9525 11.7393 17.8972 12.327 19.6677C12.9144 21.4378 14.3168 22.8183 16.0962 23.3776H16.096ZM17.8382 15.5149C18.4543 15.5149 19.045 15.76 19.4808 16.1955C19.9162 16.6309 20.1609 17.2219 20.1609 17.838C20.1609 18.4541 19.9162 19.0447 19.4808 19.4806C19.045 19.916 18.4544 20.1607 17.8382 20.1607C17.2221 20.1607 16.6311 19.916 16.1957 19.4806C15.7603 19.0447 15.5152 18.4541 15.5152 17.838C15.5152 17.2219 15.7603 16.6309 16.1957 16.1955C16.6311 15.76 17.2221 15.5149 17.8382 15.5149Z"
                     fill="white"
                  />
                  <path
                     d="M0.998047 29.4511C0.998047 31.4533 1.79357 33.3731 3.20919 34.7889C4.62481 36.2046 6.54477 37 8.54697 37H27.1287C29.1309 37 31.0512 36.2045 32.4668 34.7889C33.8824 33.3732 34.6775 31.4533 34.6775 29.4511V11.4501C36.0242 10.4403 36.8663 8.89538 36.9859 7.21649C37.105 5.53719 36.4897 3.889 35.2996 2.69861C34.1093 1.50853 32.4611 0.893324 30.7818 1.01236C29.1029 1.13185 27.558 1.97395 26.5482 3.32077H8.54718C6.54498 3.32077 4.62511 4.11588 3.20939 5.53149C1.79368 6.9471 0.998254 8.86749 0.998254 10.8696L0.998047 29.4511ZM31.1933 4.48192C31.809 4.48192 32.4 4.72657 32.8354 5.1624C33.2712 5.59782 33.5159 6.18879 33.5159 6.80447C33.5159 7.42055 33.2712 8.01156 32.8354 8.44696C32.4 8.88279 31.809 9.12744 31.1933 9.12744C30.5772 9.12744 29.9862 8.88279 29.5508 8.44696C29.115 8.01154 28.8703 7.42057 28.8703 6.80447C28.8703 6.1888 29.115 5.5978 29.5508 5.1624C29.9863 4.72657 30.5772 4.48192 31.1933 4.48192ZM4.48212 10.8696C4.48212 9.79139 4.91025 8.75768 5.67251 7.99533C6.43481 7.23302 7.46888 6.80452 8.54676 6.80452H25.3864C25.3864 8.34488 25.9981 9.82177 27.0872 10.9105C28.176 11.9997 29.6528 12.6113 31.1932 12.6113V29.451C31.1932 30.5289 30.7647 31.5629 30.0024 32.3252C29.2401 33.0875 28.2065 33.5156 27.1282 33.5156H8.54645C7.46857 33.5156 6.43454 33.0875 5.6722 32.3252C4.90989 31.5629 4.48181 30.5289 4.48181 29.451L4.48212 10.8696Z"
                     fill="white"
                  />
               </svg>
            }
            title="تعیین دقیق میزان حد ضرر"
            paragraph="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
         />
      </div>
   );

   const MobileProperties = (
      <Swiper
         className={classes.swiper}
         spaceBetween={width > breakpointMobile ? 25 : 10}
         slidesPerView={1}
      >
         <SwiperSlide>
            <Property
               image="/properties/property_1.png"
               alt="property"
               icon={
                  <svg
                     width="36"
                     height="36"
                     viewBox="0 0 36 36"
                     fill="none"
                     xmlns="http://www.w3.org/2000/svg"
                  >
                     <path
                        d="M17.8999 1C17.9554 10.3878 10.3908 18.045 1 18.1005C10.3908 18.045 18.0461 25.6118 18.1012 35C18.0461 25.6118 25.6126 17.955 35 17.8991C25.6126 17.955 17.9554 10.3878 17.8999 1Z"
                        stroke="white"
                        strokeWidth="3.5"
                     />
                  </svg>
               }
               title="سیگنال‌های لحظه‌ای خرید و فروش"
               paragraph="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
            />
         </SwiperSlide>
         <SwiperSlide>
            <Property
               image="/properties/property_1.png"
               alt="property"
               icon={
                  <svg
                     width="31"
                     height="34"
                     viewBox="0 0 31 34"
                     fill="none"
                     xmlns="http://www.w3.org/2000/svg"
                  >
                     <path
                        d="M13.2671 10.22C13.2671 11.3722 12.3332 12.3064 11.1811 12.3064C10.0289 12.3064 9.09473 11.3722 9.09473 10.22C9.09473 9.06788 10.0289 8.13403 11.1811 8.13403C12.3332 8.13403 13.2671 9.06788 13.2671 10.22Z"
                        fill="white"
                     />
                     <path
                        d="M22.6553 10.22C22.6553 11.3722 21.7211 12.3064 20.5689 12.3064C19.4168 12.3064 18.4829 11.3722 18.4829 10.22C18.4829 9.06788 19.4168 8.13403 20.5689 8.13403C21.7211 8.13403 22.6553 9.06788 22.6553 10.22Z"
                        fill="white"
                     />
                     <path
                        d="M21.0904 20.1295C24.6306 20.1295 27.9019 18.2407 29.6722 15.1745C31.4425 12.1088 31.4425 8.33137 29.6722 5.26515C27.9019 2.19901 24.6306 0.310547 21.0904 0.310547H10.6595C7.11929 0.310547 3.84799 2.19901 2.07771 5.26515C0.307431 8.33128 0.307431 12.1086 2.07771 15.1745C3.84799 18.2407 7.11929 20.1295 10.6595 20.1295H13.7889V24.302L9.61648 24.3016C7.67996 24.3016 5.82279 25.071 4.45335 26.4404C3.08392 27.8098 2.31455 29.667 2.31455 31.6035V33.6895H6.48701V31.6035C6.48701 30.7737 6.81662 29.9777 7.4038 29.3909C7.99061 28.8037 8.78664 28.4741 9.61646 28.4741H22.1336C22.9634 28.4741 23.7594 28.8037 24.3462 29.3909C24.9334 29.9777 25.263 30.7737 25.263 31.6035V33.6895H29.4355V31.6035C29.4355 29.667 28.666 27.8098 27.2967 26.4404C25.9273 25.071 24.0701 24.3016 22.1336 24.3016H17.9611V20.1295L21.0904 20.1295ZM4.92247 10.2201C4.92247 8.69869 5.52711 7.23948 6.60287 6.16332C7.67902 5.08754 9.13824 4.48329 10.6597 4.48329H21.0906C23.1403 4.48329 25.0342 5.57649 26.0591 7.35152C27.0839 9.12683 27.0839 11.3137 26.0591 13.0887C25.0342 14.8637 23.1403 15.9573 21.0906 15.9573H10.6597C9.13824 15.9573 7.67902 15.3527 6.60287 14.2769C5.52709 13.2011 4.92247 11.7419 4.92247 10.2201Z"
                        fill="white"
                     />
                  </svg>
               }
               title="هوش مصنوعی پیشرفته"
               paragraph="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
            />
         </SwiperSlide>
         <SwiperSlide>
            <Property
               image="/properties/property_1.png"
               alt="property"
               icon={
                  <svg
                     width="37"
                     height="37"
                     viewBox="0 0 37 37"
                     fill="none"
                     xmlns="http://www.w3.org/2000/svg"
                  >
                     <path
                        d="M16.096 23.3776V28.8711H19.5804V23.3776C21.3595 22.8182 22.7619 21.4378 23.3496 19.6677C23.9374 17.8972 23.6384 15.9524 22.5468 14.4399C21.4552 12.9274 19.7036 12.0314 17.8383 12.0314C15.973 12.0314 14.2211 12.9274 13.1295 14.4399C12.0379 15.9525 11.7393 17.8972 12.327 19.6677C12.9144 21.4378 14.3168 22.8183 16.0962 23.3776H16.096ZM17.8382 15.5149C18.4543 15.5149 19.045 15.76 19.4808 16.1955C19.9162 16.6309 20.1609 17.2219 20.1609 17.838C20.1609 18.4541 19.9162 19.0447 19.4808 19.4806C19.045 19.916 18.4544 20.1607 17.8382 20.1607C17.2221 20.1607 16.6311 19.916 16.1957 19.4806C15.7603 19.0447 15.5152 18.4541 15.5152 17.838C15.5152 17.2219 15.7603 16.6309 16.1957 16.1955C16.6311 15.76 17.2221 15.5149 17.8382 15.5149Z"
                        fill="white"
                     />
                     <path
                        d="M0.998047 29.4511C0.998047 31.4533 1.79357 33.3731 3.20919 34.7889C4.62481 36.2046 6.54477 37 8.54697 37H27.1287C29.1309 37 31.0512 36.2045 32.4668 34.7889C33.8824 33.3732 34.6775 31.4533 34.6775 29.4511V11.4501C36.0242 10.4403 36.8663 8.89538 36.9859 7.21649C37.105 5.53719 36.4897 3.889 35.2996 2.69861C34.1093 1.50853 32.4611 0.893324 30.7818 1.01236C29.1029 1.13185 27.558 1.97395 26.5482 3.32077H8.54718C6.54498 3.32077 4.62511 4.11588 3.20939 5.53149C1.79368 6.9471 0.998254 8.86749 0.998254 10.8696L0.998047 29.4511ZM31.1933 4.48192C31.809 4.48192 32.4 4.72657 32.8354 5.1624C33.2712 5.59782 33.5159 6.18879 33.5159 6.80447C33.5159 7.42055 33.2712 8.01156 32.8354 8.44696C32.4 8.88279 31.809 9.12744 31.1933 9.12744C30.5772 9.12744 29.9862 8.88279 29.5508 8.44696C29.115 8.01154 28.8703 7.42057 28.8703 6.80447C28.8703 6.1888 29.115 5.5978 29.5508 5.1624C29.9863 4.72657 30.5772 4.48192 31.1933 4.48192ZM4.48212 10.8696C4.48212 9.79139 4.91025 8.75768 5.67251 7.99533C6.43481 7.23302 7.46888 6.80452 8.54676 6.80452H25.3864C25.3864 8.34488 25.9981 9.82177 27.0872 10.9105C28.176 11.9997 29.6528 12.6113 31.1932 12.6113V29.451C31.1932 30.5289 30.7647 31.5629 30.0024 32.3252C29.2401 33.0875 28.2065 33.5156 27.1282 33.5156H8.54645C7.46857 33.5156 6.43454 33.0875 5.6722 32.3252C4.90989 31.5629 4.48181 30.5289 4.48181 29.451L4.48212 10.8696Z"
                        fill="white"
                     />
                  </svg>
               }
               title="تعیین دقیق میزان حد ضرر"
               paragraph="لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد."
            />
         </SwiperSlide>
      </Swiper>
   );

   return (
      <div className={classes.properties}>
         <Container>
            <div className={classes.properties_arrow}>
               <svg
                  width="19"
                  height="27"
                  viewBox="0 0 19 27"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
               >
                  <path
                     d="M9.5 0V25.5M9.5 25.5L1 17M9.5 25.5L18 17"
                     stroke="white"
                     strokeWidth="1.6"
                  />
               </svg>
            </div>
            {width > breakpoint ? DesktopProperties : MobileProperties}
         </Container>
      </div>
   );
};

export default Properties;
